wavetest/T5/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   100;	
    outerDistance   101;	

    centreOfMass    (0 0 -0.096);

    // Cuboid dimensions
		Rad = 0.2575;
		
		
    // Density of the solid
    rhoSolid        700.0;

    // Cylinder mass
    mass            35.85;	
	
    //moment of inertia about the centre of mass

    momentOfInertia (0.9 0.9 1.2);
	
    report          on;
    accelerationRelaxation 	0.95;
	accelerationDamping    1.00;


    solver
    {
        type Newmark;
    }

    constraints
    {
        AxisConstraint
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
		fixedPoint
		{
			sixDoFRigidBodyMotionConstraint point;
			centreOfRotation (0 0 -0.096);
		}
    }
}


// ************************************************************************* //
